Revit 2027 API
FabricationNetworkChangeService.GetMapOfAllSizesForStraights Method
 Get a set of FabricationPartSizeMapSet of all straight sizes for all services.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<FabricationPartSizeMap> GetMapOfAllSizesForStraights()
Public Function GetMapOfAllSizesForStraights As ISet(Of FabricationPartSizeMap)
public:
ISet<FabricationPartSizeMap^>^ GetMapOfAllSizesForStraights()
member GetMapOfAllSizesForStraights : unit -> ISet<FabricationPartSizeMap>
Return Value
ISet<FabricationPartSizeMap>
 Returns the map of sizes for straights or an empty map if there are none.
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace